app/controllers/images_controller.rb

SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", nil]]
---
    def set_image
      @image = Image.find(params[:id])